{
    "leaves": [
      {
        "id": "acacia",
        "scientificName": "Acacia propinqua",
        "englishName": "Acacia",
        "otherNames": ["Cow Tamarind"],
        "description": {
          "generalInfo": "Acacia propinqua is a large umbraculiform tree growing to a height of 20 to 25 meters. Bark is rough and furrowed. Branches are widespread.",
          "botany": "Leaves are evenly bipinnate and hairy underneath. Pinnae are 8 to 12 and 15 centimeters long or less. Leaflets are 12 to 16 in the upper pinnae, 6 to 10 in the lower ones, decreasing in size downward, hairy beneath, with the mid-nerve diagonal, and oblong-rhomboid, 1.5 to 4 centimeters long. Flowers are pink, borne in dense, peduncled, axillary, solitary, fascicled heads. Fruits are pods, straight, somewhat fleshy, indehiscent, 15 to 20 centimeters long, 2 centimeters wide, with a pulpy sweet mesocarp.",
          "distribution": [
            "Throughout the Philippines in waste places along roads and trails in fallow, rice paddies, etc.",
            "Widely planted as a shade tree and avenue tree.",
            "Introduced here about 1860 from tropical America."
          ]
        },
        "uses": [
          "Fodder: Seasonally abundant pods with sweet pulp are ground into fodder and can be used for alcohol production.",
          "Fuel: Produces high-quality firewood and charcoal, with vigorous regrowth after lopping or pollarding.",
          "Gum/Resin: Bark is a significant source of gum and resin.",
          "Mesocarp of the fruit is sweetish, sometimes eaten by children.",
          "Wood: Valued for its shade. Popularly used in carving, making tables, wood basins and bowls. Hats are made from the shavings of the wood."
        ],
        "folklore": [
          "Acacia trees are often associated with kapres. It is said that they live in Acacia trees and townsfolk often warn people to not stand under the tree or the kapre will get you.",
          "Kapre or ogre is described as giant dark, hairy, and muscular creatures that usually smoke big pipes. They are mostly seen sitting under the trees.",
          "Kapres are believed to be nocturnal and omnivorous. They are not necessarily considered to be evil. However, they may turn vengeful when the tree that they are inhabiting is cut down.",
          "They may make contact with people to offer friendship, or if they are attracted to a woman. If a Kapre befriends a human, especially because of love, the Kapre will consistently follow its \"love interest\" throughout life.",
          "Also, if one is a friend of the Kapre, then that person will have the ability to see it and if they were to sit on it then any other person would be able to see the huge entity."
        ],
        "imageUrl": "/static/img/tree-acacia.jpg"
      }

    ]
  }